Repository: cterveen/bookexportrtf-9.x
Catalog: translations/bookexportrtf.*.po
Languages: nl

source: Book Export RTF
nl: Boek Export RTF

source: Contents
nl: Inhoud

source: Download this page (and its subpages) as RTF file.
nl: Download deze pagina (en zijn subpagina's) als RTF bestand.

source: Generated:
nl: Gegenereerd:

source: Not a book page, so nothing to export.
nl: Geen boekpagina, exporteren niet mogelijk.

source: RTF version
nl: RTF versie

source: The Boek Export RTF module makes it possible to download a <i>Book</i> or <i>Book</i>-page as an RTF document.
nl: De Boek Export RTF module maakt het mogelijk om een <i>Boek</i> of <i>Boek</i>-pagina als RTF document te downloaden.

source: The dependencies for the Book Export RTF module are the Book module, Simple HTML DOM and Schepp's CSS parser. Installation instructions for these dependencies are available during the installation process.
nl: De Boek Export RTF module maakt gebruik van de Boek module, Simple HTML DOM en Schepp's CSS parser. Instructies voor het installeren van deze paketten wordt verstrekt tijdens het installeren van de module.

source: Downloading the RTF document
nl: Het RTF document downloaden

source: The document can be downloaded through the link at the bottom of the book page. The RTF document contains the current page and its subpages.
nl: Het document kan worden gedownload via de link onderaan de boek-pagina. Het RTF document bevat de huidige pagina en zijn subpagina's.

source: Adding terms to the index
nl: Termen toevoegen aan de index

source: The Book Export RTF module can add an index to the book. To add a term to the index make a named anchor with the name <i>index[Term]</i> to the book. For example, <code>&lt;a name="indexExample"&gt;&lt;/a&gt;</code> will add the term <i>Example</i> to the index. The index can also be shown on your website using the Book Index module.
nl: De Boek Export RTF module kan een index toevoegen aan het boek. Om termen aan de index toe te voegen wordt een named anchor met de naam <i>index[Term]</i> toegevoegd aan het boek. Bijvoorbeeld: <code>&lt;a name="indexVoorbeeld"&gt;&lt;/a&gt;</code> zal de term term <i>Voorbeeld</i> toevoegen. De index kan ook op de website worden weergegeven met behuld van de Book Index module.

source: White space
nl: Witruimte

source: Whitespace handling differs between HTML and RTF. Whereas HTML ignores whitespace between structural elements and shows multiple whitespace elements as a single space RTF only ignores a single space after a tag. Therefore whitespace between structural elements is removed, however whitespace within texts is preserved. Newlines are ignored by both RTF and HTML and are removed except when embeded in <code>&lt;pre&gt;&hellip;&lt;/pre&gt;</code> tags. The HTML newline element <code>&lt;br /&gt;</code> is replaced by a newline in RTF.
nl: Witruimte wordt verschillend geïnterpreteerd tussen HTML en RTF. HTML negeert witruimte tussen structurele elementen en voegt meerdere witruimte-delen samen. RTF negeert alleen een enkele spatie na een tag. Witruimte tussen structurele elementen wordt verwijderd, maar witruimte binnen teksten blijft bewaard. Regeleindes worden genegeerd door zowel RTF als HTML en worden verwijderd tenzij ze tussen <code>&lt;pre&gt;&hellip;&lt;/pre&gt;</code> tags staan. Het HTML regeleinde element <code>&lt;br /&gt;</code> wordt vervangen door een regeleinde in RTF.

source: Styling
nl: Opmaak

source: The style of the book, including the page size, is set through CSS. A custom CSS file named bookexportrtf.rtf.css can be added to the theme's css directory. A list of supported elements, classes, properties and values is in the modules CSS file.
nl: De opmaak van het boek wordt ingesteld met behulp van CSS. Een eigen CSS file genaamd bookexportrtf.rtf.css kan in de css-directory van het thema worden toegeveogd. A lijst met ondersteunde elementen, classes, eigenschappen en waarden staat in het CSS bestand van de module.

source: Translations will be read from /modules/bookexportrtf/translations. If the module is installed in a different directory the po file(s) may be uploaded manually. To make a new translation copy bookexportrtf.nl.po and replace the language code in the file name (nl) by the target language code. Then replace each string identified with msgstr with the new translation of the string identified by msgid in the previous line. Finally update the interface translations.
nl: Vertalingen worden uitgelezen uit de /modules/bookexportrtf/translations directory. Wanneer de module in een andere directory wordt geplaatst is het mogelijk om de po-bestanden handmatig up te loaden. Om een nieuwe vertaling toe te voegen zal eerst bookexportrtf.nl.po worden gekopiëerd, waarbij de taalcode (nl) wordt vervangen door de nieuwe taalcode. Vervang daarna alle teksten gemerkt met msgstr door een nieuwe vertaling van de tekst gemerkt met msgid op de voorgaande regel. Vernieuw tot slot de gebruikersinterfacevertaling.
